app/Controllers/Admin/Page.php

SELECT *
FROM `languages`
SELECT *
FROM `pages`
ORDER BY `created_at` ASC
SELECT *
FROM `pages`
WHERE `pages`.`id` = '5'
---
    public function form($id = null)
    {
        $pageModel = new PageModel();
        $pageBuilder = new PageBuilder();
        $languageModel = new LanguageModel();

        $data['languages'] = $languageModel->findAll();
        $data['pages'] = array_filter($pageModel->orderBy('created_at', 'ASC')->findAll(), function($p) use ($id) {
            return $p['id'] !== $id && $p['parent_id'] !== $id;
        });
        $data['settings'] = [
            'layout' => 'admin_edit',
            'menu' => [
                'id' => 2
            ],
            'path' => '/admin/pages/form'
        ];

        $data['components'] = $pageBuilder->listComponents();

        if ($id) {
            $data['page'] = $pageModel->find($id);