app/Controllers/Auth.php

    public function authenticate()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1

    public function store()
    {
        $session = session();
        $model = new UserModel();


        if (!$this->validate($model->validationRules)) {
            $this->data['settings'] = [
                'layout' => 'default',
                'menu' => [
                    'id' => 2
                ],
                'title' => 'Register',
                'path' => '/auth/register'
            ];
            $this->data['validation'] =  $this->validator;
            return view('auth/register', $this->data);
        }

        $data = [
            'username' => $this->request->getVar('username'),
            'email'    => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
        ];

        $model->save($data);
---
INSERT INTO `users` (`username`, `email`, `password`) VALUES ('admin', 'asd@sadasd.com', '$2y$10$Q1JSIGUllKAPX3MeDehmJuau/pFo2/7JfgSjUrbtefHjD7aEjCMvi')